Terraform plan for __production__
<details>
  <summary>Plan: 8 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/lambda-without-layer"
      + retention_in_days = 0
      + tags              = {
          + "Module" = "lambda-without-layer"
        }
    }

  # module.lambda_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "lambda-without-layer-logs"
      + path   = "/"
      + policy = (known after apply)
    }

  # module.lambda_function.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "lambda-without-layer-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "lambda-without-layer",
        ]
    }

  # module.lambda_function.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-without-layer"
      + path                  = "/"
      + tags                  = {
          + "Module" = "lambda-without-layer"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.lambda_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "My awesome lambda function"
      + function_name                  = "lambda-without-layer"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + s3_bucket                      = "my-bucket-with-lambda-builds"
      + s3_key                         = "***************************************************************************"
      + s3_object_version              = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Module" = "lambda-without-layer"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "Serverless" = "Terraform"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.lambda_function.aws_s3_bucket_object.lambda_package[0] will be created
  + resource "aws_s3_bucket_object" "lambda_package" {
      + acl                    = "private"
      + bucket                 = "my-bucket-with-lambda-builds"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "builds/0edd86c522037e95bfadcdf92c7c79e05d26f43ec08fee11edb161a2864d39b7.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "builds/0edd86c522037e95bfadcdf92c7c79e05d26f43ec08fee11edb161a2864d39b7.zip"
      + storage_class          = "ONEZONE_IA"
      + tags                   = {
          + "Module" = "lambda-without-layer"
        }
      + version_id             = (known after apply)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../dist",
                      + null,
                    ],
                ]
              + filename      = "builds/0edd86c522037e95bfadcdf92c7c79e05d26f43ec08fee11edb161a2864d39b7.zip"
              + runtime       = "nodejs12.x"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0edd86c522037e95bfadcdf92c7c79e05d26f43ec08fee11edb161a2864d39b7.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/0edd86c522037e95bfadcdf92c7c79e05d26f43ec08fee11edb161a2864d39b7.zip"
          + "timestamp" = "1616718969265635000"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [plan #28](https://github.com/mkohlmyr/actionable/actions/runs/688379291)